19-rails-review/app/views/cars/new.html.erb

    <%= f.label :owner_id %>
    <%= f.collection_select :owner_id, Owner.all, :id, :name %>
    <%= f.label :mechanic_id %>
    <%= f.collection_select :mechanic_id, Mechanic.all, :id, :name %>
---
SELECT "owners".* FROM "owners"
SELECT "mechanics".* FROM "mechanics"

    <datalist id="brand-names">
        <% Brand.all.each do |brand| %>
---
SELECT "brands".* FROM "brands"