17-rails-forms-w-assoc/trainshop/app/controllers/trains_controller.rb

  def create
    train = Train.create(train_params)
---
INSERT INTO "trains" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bob"], ["price", 4123], ["created_at", "2019-02-01 15:15:41.092531"], ["updated_at", "2019-02-01 15:15:41.092531"]]

  def update
    @train.update(train_params)
---
UPDATE "trains" SET "price" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["price", 374], ["updated_at", "2019-02-01 15:36:25.258371"], ["id", 9]]

  def find_train
    @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]