20-rails-sessions-cookies/trainshop/app/controllers/trains_controller.rb

  def find_train
    @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]