20-rails-sessions-cookies/trainshop/app/controllers/trains_controller.rb

  def create
    train = Train.create(train_params)
---
INSERT INTO "trains" ("name", "price", "created_at", "updated_at", "conductor_id") VALUES (?, ?, ?, ?, ?)  [["name", "the rain train"], ["price", 3], ["created_at", "2019-02-04 11:50:04.404168"], ["updated_at", "2019-02-04 11:50:04.404168"], ["conductor_id", 3]]

  def update
    @train.update(train_params)
---
UPDATE "trains" SET "price" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["price", 374], ["updated_at", "2019-02-01 15:36:25.258371"], ["id", 9]]

  def find_train
    @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def find_conductors
    @conductors = Conductor.all
---
SELECT "conductors".* FROM "conductors"