19-rails-review/app/views/owners/show.html.erb

SELECT "cars".* FROM "cars" WHERE "cars"."owner_id" = ?  [["owner_id", 2]]
---
<ul>
    <% @owner.cars.each do |car|%>

SELECT "brands".* FROM "brands" INNER JOIN "cars" ON "brands"."id" = "cars"."brand_id" WHERE "cars"."owner_id" = ?  [["owner_id", 2]]
---
<ul>
    <% @owner.brands.each do |brand|%>