19-rails-review/app/controllers/cars_controller.rb

INSERT INTO "cars" ("brand_id", "owner_id", "mechanic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brand_id", 2], ["owner_id", 1], ["mechanic_id", 1], ["created_at", "2019-02-06 13:43:37.080385"], ["updated_at", "2019-02-06 13:43:37.080385"]]
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "audi"], ["created_at", "2019-02-06 13:43:37.076580"], ["updated_at", "2019-02-06 13:43:37.076580"]]
SELECT  "brands".* FROM "brands" WHERE "brands"."name" = ? LIMIT ?  [["name", "audi"], ["LIMIT", 1]]
---
    def create
        car = Car.create(car_params)
        car.brand = Brand.find_or_create_by(name: params["brand_name"])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_car
        @car = Car.find(params["id"])