19-rails-review/app/controllers/owners_controller.rb

INSERT INTO "owners" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dan"], ["created_at", "2019-02-06 13:51:38.792770"], ["updated_at", "2019-02-06 13:51:38.792770"]]
---
    def create
        owner = Owner.create(params.require(:owner).permit(:name))

SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @owner = Owner.find(params["id"])